Distributed Job Scheduler Added in HLD Notes & Zoom effect of mermaid added
